import { some } from "utils/helpers";

export const dataDiaryFake: some[] = [
  {
    id: 1,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 2,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 3,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 4,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 5,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 6,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 7,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 8,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
];

export const dataDiaryFake1: some[] = [
  {
    id: 1,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 2,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 3,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 4,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 5,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 6,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 7,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 8,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 9,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 10,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 11,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 12,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 13,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 14,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
];

export const BUTTON_TYPE_LISTS: some[] = [
  {
    id: 1,
    name: "日",
  },
  {
    id: 2,
    name: "週",
  },
  {
    id: 3,
    name: "月",
  },
  {
    id: 4,
    name: "年",
  },
];
