import { some } from "utils/helpers";
import { dataChart } from "../dashboard/utilts";

export const dataDiaryFake: some[] = [
  {
    id: 1,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 2,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 3,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 4,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 5,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 6,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 7,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
  {
    id: 8,
    date: "2021.05.21",
    time: "23:25",
    title: "私の日記の記録が一部表示されます。",
    content:
      "テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト",
  },
];

export const dataDiaryFake1: some[] = [
  {
    id: 1,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 2,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 3,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 4,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 5,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 6,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 7,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 8,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 9,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 10,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 11,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 12,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 13,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
  {
    id: 14,
    unit: "kcal",
    calories: "26",
    time: "10",
    content: "家事全般（立位・軽い",
  },
];

export const dataChart1 = [
  {
    name: "6日",
    data1: 1200,
    data2: 9800,
  },
  {
    name: "7日",
    data1: 3400,
    data2: 7600,
  },
  {
    name: "8日",
    data1: 6500,
    data2: 5600,
  },
  {
    name: "9日",
    data1: 7800,
    data2: 4300,
  },
  {
    name: "10日",
    data1: 2300,
    data2: 5600,
  },
  {
    name: "1日",
    data1: 4500,
    data2: 2130,
  },
  {
    name: "2日",
    data1: 5500,
    data2: 7200,
  },
  {
    name: "3日",
    data1: 3000,
    data2: 5200,
  },
  {
    name: "4日",
    data1: 4000,
    data2: 4800,
  },
  {
    name: "5日",
    data1: 1200,
    data2: 1000,
  },
];

export const dataChart2 = [
  {
    name: "6週",
    data1: 3424,
    data2: 6756,
  },
  {
    name: "7週",
    data1: 7897,
    data2: 2321,
  },
  {
    name: "8週",
    data1: 3423,
    data2: 7876,
  },
  {
    name: "9週",
    data1: 9080,
    data2: 3434,
  },
  {
    name: "10週",
    data1: 5800,
    data2: 6500,
  },
  {
    name: "1週",
    data1: 4500,
    data2: 5500,
  },
  {
    name: "2週",
    data1: 3465,
    data2: 1233,
  },
  {
    name: "3週",
    data1: 8989,
    data2: 5676,
  },
  {
    name: "4週",
    data1: 2000,
    data2: 4800,
  },
  {
    name: "5週",
    data1: 3434,
    data2: 2312,
  },
];

export const dataChart3 = [
  {
    name: "6年",
    data1: 5000,
    data2: 7000,
  },
  {
    name: "7年",
    data1: 8800,
    data2: 8000,
  },
  {
    name: "8年",
    data1: 7500,
    data2: 6000,
  },
  {
    name: "9年",
    data1: 5800,
    data2: 4000,
  },
  {
    name: "10年",
    data1: 5800,
    data2: 6500,
  },
  {
    name: "1年",
    data1: 4500,
    data2: 5500,
  },
  {
    name: "2年",
    data1: 2500,
    data2: 2000,
  },
  {
    name: "3年",
    data1: 3000,
    data2: 5200,
  },
  {
    name: "4年",
    data1: 2000,
    data2: 4800,
  },
  {
    name: "5年",
    data1: 0,
    data2: 7000,
  },
];

export const BUTTON_TYPE_LISTS: some[] = [
  {
    id: 1,
    name: "日",
    dataChart: dataChart1,
  },
  {
    id: 2,
    name: "週",
    dataChart: dataChart2,
  },
  {
    id: 3,
    name: "月",
    dataChart,
  },
  {
    id: 4,
    name: "年",
    dataChart: dataChart3,
  },
];
